document.getElementById("myForm").addEventListener("submit", function(event) {
event.preventDefault(); // 폼 제출 막기

// 성별과 나이를 가져옵니다.
const genderSelect = document.getElementById("gender");
const gender = genderSelect.options[genderSelect.selectedIndex].text;
const age = document.getElementById("age").value;
// 테이블을 생성할 컨테이너를 가져옵니다.
const tableContainer = document.getElementById("table-container");
// 테이블 생성을 위한 HTML 코드를 작성합니다.
if(gender=='남자'){
    if(age<=25){
        df = {'특급':["72이상","86이상","12:30이하"],'1급':["64-71","78-85","12:31-13:32"],'2급':["56-63","70-77","13:33-14:34"],'3급':["48-55","62-69","14:35-15:36"]}
    }
    else if(age>=26 & age<=30){
        df = {'특급':["70이상","84이상","12:45이하"],'1급':["62-69","76-83","12:46-13:52"],'2급':["56-63","70-77","13:33-14:34"],'3급':["48-55","62-69","14:35-15:36"]}
    }
    else if(age>=31 & age<=35){
        df = {'특급':["68이상","80이상","13:00이하"],'1급':["60-67","72-79","13:01-14:12"],'2급':["56-63","70-77","13:33-14:34"],'3급':["48-55","62-69","14:35-15:36"]}
    } 
    else if(age>=36 & age<=40){
        df = {'특급':["65이상","76이상","13:15이하"],'1급':["57-64","68-75","13:16-14:32"],'2급':["56-63","70-77","13:33-14:34"],'3급':["48-55","62-69","14:35-15:36"]}
    }
    else if(age>=41 & age<=43){
        df = {'특급':["61이상","72이상","13:30이하"],'1급':["53-60","64-71","13:31-14:49"],'2급':["56-63","70-77","13:33-14:34"],'3급':["48-55","62-69","14:35-15:36"]}
    }
    else if(age>=44 & age<=46){
        df = {'특급':["57이상","68이상","13:45이하"],'1급':["49-56","60-67","13:46-15:05"],'2급':["56-63","70-77","13:33-14:34"],'3급':["48-55","62-69","14:35-15:36"]}
    }
    else if(age>=47 & age<=49){
        df = {'특급':["54이상","65이상","14:00이하"],'1급':["46-53","57-64","14:01-15:25"],'2급':["56-63","70-77","13:33-14:34"],'3급':["48-55","62-69","14:35-15:36"]}
    }
    else if(age>=50 & age<=51){
        df = {'특급':["51이상","62이상","14:15이하"],'1급':["43-50","54-61","14:16-15:42"],'2급':["56-63","70-77","13:33-14:34"],'3급':["48-55","62-69","14:35-15:36"]}
    }
    else if(age>=52 & age<=53){
        df = {'특급':["49이상","60이상","14:30이하"],'1급':["41-48","52-59","14:31-16:02"],'2급':["56-63","70-77","13:33-14:34"],'3급':["48-55","62-69","14:35-15:36"]}
    }
    else if(age>=54 & age<=55){
        df = {'특급':["47이상","58이상","14:45이하"],'1급':["39-46","50-57","14:46-16:19"],'2급':["56-63","70-77","13:33-14:34"],'3급':["48-55","62-69","14:35-15:36"]}
    }
    else if(age>=56 & age<=57){
        df = {'특급':["44이상","56이상","15:10이하"],'1급':["36-43","48-55","15:11-16:46"],'2급':["56-63","70-77","13:33-14:34"],'3급':["48-55","62-69","14:35-15:36"]}
    }
    else if(age>=58 & age<=59){
        df = {'특급':["42이상","54이상","15:35이하"],'1급':["34-41","46-53","15:36-17:13"],'2급':["56-63","70-77","13:33-14:34"],'3급':["48-55","62-69","14:35-15:36"]}
    }
    else if(age>=60){
        df = {'특급':["40이상","52이상","16:00이하"],'1급':["32-39","44-51","16:01-17:40"],'2급':["56-63","70-77","13:33-14:34"],'3급':["48-55","62-69","14:35-15:36"]}
    }
} 
else if(gender=='여자'){
    console.log(gender);
}


const tableHTML = `
<h1>특급</h1>
<table class="table table-striped">
    <thead>
    <tr>
        <th scope="col">종목</th>
        <th scope="col">횟수</th>
    </tr>
    </thead>
    <tbody>
    <tr>
        <th scope="row">팔굽혀펴기</th>
        <td>${df['특급'][0]}</td>
    </tr>
    <tr>
        <th scope="row">윗몸일으키기</th>
        <td>${df['특급'][1]}</td>
    </tr>
    <tr>
        <th scope="row">3km 달리기</th>
        <td>${df['특급'][2]}</td>
    </tr>
    </tbody>
</table>
<h1>1급</h1>
<table class="table table-striped">
    <thead>
    <tr>
        <th scope="col">종목</th>
        <th scope="col">횟수</th>
    </tr>
    </thead>
    <tbody>
    <tr>
        <th scope="row">팔굽혀펴기</th>
        <td>${df['1급'][0]}</td>
    </tr>
    <tr>
        <th scope="row">윗몸일으키기</th>
        <td>${df['1급'][1]}</td>
    </tr>
    <tr>
        <th scope="row">3km 달리기</th>
        <td>${df['1급'][2]}</td>
    </tr>
    </tbody>
</table>
<h1>2급</h1>
<table class="table table-striped">
    <thead>
    <tr>
        <th scope="col">종목</th>
        <th scope="col">횟수</th>
    </tr>
    </thead>
    <tbody>
    <tr>
        <th scope="row">팔굽혀펴기</th>
        <td>${df['2급'][0]}</td>
    </tr>
    <tr>
        <th scope="row">윗몸일으키기</th>
        <td>${df['2급'][1]}</td>
    </tr>
    <tr>
        <th scope="row">3km 달리기</th>
        <td>${df['2급'][2]}</td>
    </tr>
    </tbody>
</table>
<h1>3급</h1>
<table class="table table-striped">
    <thead>
    <tr>
        <th scope="col">종목</th>
        <th scope="col">횟수</th>
    </tr>
    </thead>
    <tbody>
    <tr>
    <th scope="row">팔굽혀펴기</th>
    <td>${df['3급'][0]}</td>
</tr>
<tr>
    <th scope="row">윗몸일으키기</th>
    <td>${df['3급'][1]}</td>
</tr>
<tr>
    <th scope="row">3km 달리기</th>
    <td>${df['3급'][2]}</td>
</tr>
    </tbody>
</table>
`;

// 컨테이너에 테이블을 삽입합니다.
tableContainer.innerHTML = tableHTML;
});

